package main

import (
	"reflect"
	"strings"
	"testing"
)

var functionVerbTests = []struct {
	name   string
	text   string
	expect string
}{
	{
		name: "should return empty string due to containing no function verb",
		text: `* 0 -1D 0/0 0.000000
一	名詞,数,*,*,*,*,一,イチ,イチ
EOS
EOS
* 0 2D 0/0 -0.764522
　	記号,空白,*,*,*,*,　,　,　
* 1 2D 0/1 -0.764522
吾輩	名詞,代名詞,一般,*,*,*,吾輩,ワガハイ,ワガハイ
は	助詞,係助詞,*,*,*,*,は,ハ,ワ
* 2 -1D 0/2 0.000000
猫	名詞,一般,*,*,*,*,猫,ネコ,ネコ
で	助動詞,*,*,*,特殊・ダ,連用形,だ,デ,デ
ある	助動詞,*,*,*,五段・ラ行アル,基本形,ある,アル,アル
。	記号,句点,*,*,*,*,。,。,。
EOS
* 0 2D 0/1 -1.911675
名前	名詞,一般,*,*,*,*,名前,ナマエ,ナマエ
は	助詞,係助詞,*,*,*,*,は,ハ,ワ
* 1 2D 0/0 -1.911675
まだ	副詞,助詞類接続,*,*,*,*,まだ,マダ,マダ
* 2 -1D 0/0 0.000000
無い	形容詞,自立,*,*,形容詞・アウオ段,基本形,無い,ナイ,ナイ
。	記号,句点,*,*,*,*,。,。,。
EOS
EOS
`,
		expect: "",
	},
	{
		name: "should return empty string because input file only contains \"EOS\"",
		text: `EOS
EOS
EOS`,
		expect: "",
	},
	{
		name: "should return formatted function verbs",
		text: `EOS
* 0 26D 0/1 -1.536722
吾輩	名詞,代名詞,一般,*,*,*,吾輩,ワガハイ,ワガハイ
は	助詞,係助詞,*,*,*,*,は,ハ,ワ
* 1 2D 0/1 0.101119
彼	名詞,代名詞,一般,*,*,*,彼,カレ,カレ
と	助詞,並立助詞,*,*,*,*,と,ト,ト
* 2 3D 1/2 1.570905
近	名詞,固有名詞,一般,*,*,*,近,コン,コン
付	名詞,接尾,一般,*,*,*,付,ヅケ,ズケ
に	助詞,格助詞,一般,*,*,*,に,ニ,ニ
* 3 7D 0/2 1.539001
なっ	動詞,自立,*,*,五段・ラ行,連用タ接続,なる,ナッ,ナッ
て	助詞,接続助詞,*,*,*,*,て,テ,テ
から	助詞,格助詞,一般,*,*,*,から,カラ,カラ
* 4 7D 0/0 1.766242
直に	副詞,一般,*,*,*,*,直に,ジカニ,ジカニ
* 5 6D 0/0 1.527621
この	連体詞,*,*,*,*,*,この,コノ,コノ
* 6 7D 0/1 2.105114
呼吸	名詞,サ変接続,*,*,*,*,呼吸,コキュウ,コキュー
を	助詞,格助詞,一般,*,*,*,を,ヲ,ヲ
* 7 15D 0/2 0.265564
飲み込ん	動詞,自立,*,*,五段・マ行,連用タ接続,飲み込む,ノミコン,ノミコン
だ	助動詞,*,*,*,特殊・タ,基本形,だ,ダ,ダ
から	助詞,接続助詞,*,*,*,*,から,カラ,カラ
* 8 9D 0/0 1.566118
この	連体詞,*,*,*,*,*,この,コノ,コノ
* 9 15D 0/2 1.933947
場合	名詞,副詞可能,*,*,*,*,場合,バアイ,バアイ
に	助詞,格助詞,一般,*,*,*,に,ニ,ニ
も	助詞,係助詞,*,*,*,*,も,モ,モ
* 10 12D 0/0 1.095574
なまじい	副詞,一般,*,*,*,*,なまじい,ナマジイ,ナマジイ
* 11 12D 0/2 1.564928
己	名詞,代名詞,一般,*,*,*,己,オノレ,オノレ
れ	助動詞,*,*,*,文語・ル,未然形,る,レ,レ
を	助詞,格助詞,一般,*,*,*,を,ヲ,ヲ
* 12 15D 1/2 1.393099
弁護	名詞,サ変接続,*,*,*,*,弁護,ベンゴ,ベンゴ
し	動詞,自立,*,*,サ変・スル,連用形,する,シ,シ
て	助詞,接続助詞,*,*,*,*,て,テ,テ
* 13 15D 0/0 1.197025
ますます	副詞,助詞類接続,*,*,*,*,ますます,マスマス,マスマス
* 14 15D 0/1 1.177451
形勢	名詞,一般,*,*,*,*,形勢,ケイセイ,ケイセイ
を	助詞,格助詞,一般,*,*,*,を,ヲ,ヲ
* 15 16D 2/3 0.391400
わるく	形容詞,自立,*,*,形容詞・アウオ段,連用テ接続,わるい,ワルク,ワルク
する	動詞,自立,*,*,サ変・スル,基本形,する,スル,スル
の	名詞,非自立,一般,*,*,*,の,ノ,ノ
も	助詞,係助詞,*,*,*,*,も,モ,モ
* 16 24D 0/2 0.545650
愚	名詞,一般,*,*,*,*,愚,グ,グ
で	助動詞,*,*,*,特殊・ダ,連用形,だ,デ,デ
ある	助動詞,*,*,*,五段・ラ行アル,基本形,ある,アル,アル
、	記号,読点,*,*,*,*,、,、,、
* 17 18D 0/1 1.531676
いっそ	副詞,助詞類接続,*,*,*,*,いっそ,イッソ,イッソ
の	助詞,連体化,*,*,*,*,の,ノ,ノ
* 18 21D 1/2 1.364709
事	名詞,非自立,一般,*,*,*,事,コト,コト
彼	名詞,代名詞,一般,*,*,*,彼,カレ,カレ
に	助詞,格助詞,一般,*,*,*,に,ニ,ニ
* 19 20D 0/1 2.073556
自分	名詞,一般,*,*,*,*,自分,ジブン,ジブン
の	助詞,連体化,*,*,*,*,の,ノ,ノ
* 20 21D 1/2 2.201961
手柄	名詞,一般,*,*,*,*,手柄,テガラ,テガラ
話	名詞,接尾,サ変接続,*,*,*,話,バナシ,バナシ
を	助詞,格助詞,一般,*,*,*,を,ヲ,ヲ
* 21 23D 0/2 0.092104
しゃべら	動詞,自立,*,*,五段・ラ行,未然形,しゃべる,シャベラ,シャベラ
し	動詞,接尾,*,*,五段・サ行,連用形,す,シ,シ
て	助詞,接続助詞,*,*,*,*,て,テ,テ
* 22 23D 1/2 1.832754
御	接頭詞,名詞接続,*,*,*,*,御,ゴ,ゴ
茶	名詞,一般,*,*,*,*,茶,チャ,チャ
を	助詞,格助詞,一般,*,*,*,を,ヲ,ヲ
* 23 24D 0/1 0.158069
濁す	動詞,自立,*,*,五段・サ行,基本形,濁す,ニゴス,ニゴス
に	助詞,格助詞,一般,*,*,*,に,ニ,ニ
* 24 26D 2/3 -1.536722
若く	形容詞,自立,*,*,形容詞・アウオ段,連用テ接続,若い,ワカク,ワカク
は	助詞,係助詞,*,*,*,*,は,ハ,ワ
ない	形容詞,自立,*,*,形容詞・アウオ段,基本形,ない,ナイ,ナイ
と	助詞,格助詞,引用,*,*,*,と,ト,ト
* 25 26D 0/1 -1.536722
思案	名詞,サ変接続,*,*,*,*,思案,シアン,シアン
を	助詞,格助詞,一般,*,*,*,を,ヲ,ヲ
* 26 -1D 0/1 0.000000
定め	動詞,自立,*,*,一段,連用形,定める,サダメ,サダメ
た	助動詞,*,*,*,特殊・タ,基本形,た,タ,タ
。	記号,句点,*,*,*,*,。,。,。
EOS

`,
		expect: "呼吸を飲み込む\tから\tなってから\n思案を定める\tは と\t吾輩は 若くはないと",
	},
}

func TestFunctionVerb(t *testing.T) {
	for _, testcase := range functionVerbTests {
		t.Log(testcase.name)

		r := strings.NewReader(testcase.text)
		result := newChunkPassage(r).stringifyFunctionVerb()

		if !reflect.DeepEqual(result, testcase.expect) {
			t.Errorf("node result => %#v\n  should contain => %#v\n", result, testcase.expect)
		}
	}
}
